<a href="https://colab.research.google.com/github/Wpompeo/Wpompeo_DataScience/blob/master/Criando_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#import panda
import pandas as pd

In [5]:
#criando dicionário
dados_dict = {
    'nome':['Wagner', 'Tatiana', 'Santiago', 'Petrurs'],
    'idade':['38', '37', '7', '11'], 
    'cidade':['Esteio', 'Porto Alegre', 'Canoas', 'Sapucaia'],
    'comprou':[True, False, False, True]
}

In [7]:
#criar DataFrame
df = pd.DataFrame(dados_dict)

In [9]:
#visualizar DataFrame
df

       nome idade        cidade  comprou
0    Wagner    38        Esteio     True
1   Tatiana    37  Porto Alegre    False
2  Santiago     7        Canoas    False
3   Petrurs    11      Sapucaia     True

In [10]:
#criar id do usuário
id_usuario = [23, 26, 31, 15]

In [11]:
#associar o id do usuário à lista
df.index = id_usuario

In [12]:
#ver DataFrame atual
df

        nome idade        cidade  comprou
23    Wagner    38        Esteio     True
26   Tatiana    37  Porto Alegre    False
31  Santiago     7        Canoas    False
15   Petrurs    11      Sapucaia     True

In [13]:
#selecionar por id
df.loc[31]

nome       Santiago
idade             7
cidade       Canoas
comprou       False
Name: 31, dtype: object

## **DataFrame a partir de listas**
Listas também são estruturas muito usadas em *Python*, e não é incomum termos que criar *DataFrames* a partir destas.
Para organizar nossas várias listas de um modo que seja fácil sua conversão em *DataFrame*, vamos usar a função **built-in** zip().

In [32]:
#Listas
dados_lista = [['Wagner', 38, 'Esteio', True],
               ['Tatiana', 37, 'Porto Alegre', False],
               ['Santiago', 7, 'canoas', True],
               ['Petrus', 11, 'Sapucaia', False]]

In [33]:
#criar DataFrame, nomear colunas e index
df = pd.DataFrame(dados_lista, columns=['nome', 'idade', 'cidade', 'comprou'])
df.index = ['a','b','c', 'd']

In [34]:
df

       nome  idade        cidade  comprou
a    Wagner     38        Esteio     True
b   Tatiana     37  Porto Alegre    False
c  Santiago      7        canoas     True
d    Petrus     11      Sapucaia    False

In [35]:
#selecionar por id
df.loc['b']

nome            Tatiana
idade                37
cidade     Porto Alegre
comprou           False
Name: b, dtype: object

## **Criar novas colunas**
Uma maneira extremamente conveniente de criar novas colunas em um *DataFrame* é usar uma funcionalidade do Pandas conhecida como **broadcasting**.
Informando o nome da coluna e declarando apenas um valor, este é replicado para todas as linhas do *DataFrame*

In [36]:
#criar coluna "saldo"
df['saldo'] = 0.0

#visualizar df
df

       nome  idade        cidade  comprou  saldo
a    Wagner     38        Esteio     True    0.0
b   Tatiana     37  Porto Alegre    False    0.0
c  Santiago      7        canoas     True    0.0
d    Petrus     11      Sapucaia    False    0.0

## **Modificar *index* e colunas**
As vezes, precisamos alterar o nome dos índices ou o *label* das colunas. Se você olhar na célula acima, veja que na esquerda do *DataFrame* o index de cada linha é representado por um número entre 0 e 3.
É possível alterar esse atributo da variável acessando diretamente assim:

In [37]:
#alterar o index do df
df.index = ['colA', 'colB', 'colC', 'colD']

#visualiza DataFrame atual
df

          nome  idade        cidade  comprou  saldo
colA    Wagner     38        Esteio     True    0.0
colB   Tatiana     37  Porto Alegre    False    0.0
colC  Santiago      7        canoas     True    0.0
colD    Petrus     11      Sapucaia    False    0.0

Da mesma maneira, se eu precisar alterar o nome das colunas, posso alterar diretamente no atributo da variável

In [38]:
#altera os labels das colunas
df.columns = ['NOME', 'IDADE', 'CIDADE', 'COMPROU', 'SALDO']

#visualizar DataFrame atual
df

          NOME  IDADE        CIDADE  COMPROU  SALDO
colA    Wagner     38        Esteio     True    0.0
colB   Tatiana     37  Porto Alegre    False    0.0
colC  Santiago      7        canoas     True    0.0
colD    Petrus     11      Sapucaia    False    0.0